# Задача 3. Планирование задач
# Напишите функцию, которая принимает количество дней от текущей даты и
# возвращает дату, которая наступит через указанное количество дней. Дополнительно,
# выведите эту дату в формате YYYY-MM-DD.
# Подсказка № 1
# Используйте from datetime import datetime, timedelta, чтобы получить
# доступ к текущей дате и времени, а также к функции для добавления или вычитания
# дней.
# Подсказка № 2
# Вызовите datetime.now() для получения текущей даты и времени в виде объекта
# datetime.
# Подсказка № 3
# Создайте объект timedelta, который представляет собой интервал времени, а затем
# добавьте его к текущей дате для получения даты в будущем.
# Подсказка № 4
# Примените метод strftime() для преобразования объекта datetime в строку в
# формате YYYY-MM-DD.

from datetime import datetime, timedelta

while True:
    try:
        days = int(input("Введите количество дней от текущей даты: "))
        break
    except ValueError:
        print("Пожалуйста, введите корректное целое число.")

date = datetime.now() + timedelta(days=days)

print(f"Дата через {days} дней: {datetime.strftime(date, '%Y-%m-%d')}")