# Задача 2. Работа с текущим временем и датой
# Напишите скрипт, который получает текущее время и дату, а затем выводит их в
# формате YYYY-MM-DD HH:MM:SS. Дополнительно, выведите день недели и номер
# недели в году.
# Подсказка № 1
# Используйте from datetime import datetime, чтобы получить доступ к текущему
# времени и дате, а также к методам для их форматирования.
# Подсказка № 2
# Используйте datetime.now() для получения объекта datetime, содержащего
# текущее время и дату.
# Подсказка № 3
# Примените метод strftime() для форматирования даты и времени в строку с
# нужным форматом, например, '%Y-%m-%d %H:%M:%S'.
# Подсказка № 4
# Используйте strftime('%A') для получения полного названия дня недели.
# Используйте isocalendar()[1] для получения номера недели в году.

from datetime import datetime

date = datetime.now()
print("Сегодня: ", datetime.strftime(date, "%Y-%m-%d"))
print("Текущее время: ", datetime.strftime(date, "%H:%M:%S"))
print("Текущий день недели: ", datetime.strftime(date, '%A'))
print("Номер недели: ", datetime.isocalendar(date)[1])